maxboss10086/max_dsp/max/F28388D/clb_pwm/device/driverlib/clb.h
//###########################################################################
//
// FILE:   clb.h
//
// TITLE:  C28x CLB driver.
//
//###########################################################################
// $TI Release: F2838x Support Library v3.02.00.00 $
// $Release Date: Tue May 26 17:21:56 IST 2020 $
// $Copyright:
// Copyright (C) 2020 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef CLB_H
#define CLB_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup clb_api CLB
//! @{
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_clb.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"

//*****************************************************************************
//
// Address offsets from LOGICCFG to LOGICCTL and DATAEXCH register memory maps
//
//*****************************************************************************
#define CLB_LOGICCTL                0x0100U
#define CLB_DATAEXCH                0x0180U

//*****************************************************************************
//
// Address offsets for CLB-internal memory space
//
//*****************************************************************************
#define CLB_ADDR_COUNTER_0_LOAD     0x0U
#define CLB_ADDR_COUNTER_1_LOAD     0x1U
#define CLB_ADDR_COUNTER_2_LOAD     0x2U

#define CLB_ADDR_COUNTER_0_MATCH1   0x4U
#define CLB_ADDR_COUNTER_1_MATCH1   0x5U
#define CLB_ADDR_COUNTER_2_MATCH1   0x6U

#define CLB_ADDR_COUNTER_0_MATCH2   0x8U
#define CLB_ADDR_COUNTER_1_MATCH2   0x9U
#define CLB_ADDR_COUNTER_2_MATCH2   0xAU

#define CLB_ADDR_HLC_R0             0xCU
#define CLB_ADDR_HLC_R1             0xDU
#define CLB_ADDR_HLC_R2             0xEU
#define CLB_ADDR_HLC_R3             0xFU

#define CLB_ADDR_HLC_BASE           0x20U
#define CLB_NUM_HLC_INSTR           31U

//*****************************************************************************
//
// PUSH/PULL FIFO size (32-bit registers)
//
//*****************************************************************************
#define CLB_FIFO_SIZE               4U

//*****************************************************************************
//
// Key to enable writes to the CLB registers
//
//*****************************************************************************
#define CLB_LOCK_KEY                0x5A5AU

//*****************************************************************************
//
// Shift and masks needed by the API for Input selection
//
//*****************************************************************************
#define CLB_LCL_MUX_SEL_MISC_INPUT_SEL_M          0x20U
#define CLB_LCL_MUX_SEL_MISC_INPUT_SEL_S          28U
#define CLB_LCL_MUX_SEL_MISC_INPUT_SEL_BITM       (uint32_t)1U

//*****************************************************************************
//
//! Values that can be passed to control the CLB output enable signal. It can
//! be passed to CLB_setOutputMask() as the \e outputMask parameter.
//
//*****************************************************************************
#define CLB_OUTPUT_00 0x00000001U //!< Mask for CLB OUTPUT ENABLE/DISABLE 0
#define CLB_OUTPUT_01 0x00000002U //!< Mask for CLB OUTPUT ENABLE/DISABLE 1
#define CLB_OUTPUT_02 0x00000004U //!< Mask for CLB OUTPUT ENABLE/DISABLE 2
#define CLB_OUTPUT_03 0x00000008U //!< Mask for CLB OUTPUT ENABLE/DISABLE 3
#define CLB_OUTPUT_04 0x00000010U //!< Mask for CLB OUTPUT ENABLE/DISABLE 4
#define CLB_OUTPUT_05 0x00000020U //!< Mask for CLB OUTPUT ENABLE/DISABLE 5
#define CLB_OUTPUT_06 0x00000040U //!< Mask for CLB OUTPUT ENABLE/DISABLE 6
#define CLB_OUTPUT_07 0x00000080U //!< Mask for CLB OUTPUT ENABLE/DISABLE 7
#define CLB_OUTPUT_08 0x00000100U //!< Mask for CLB OUTPUT ENABLE/DISABLE 8
#define CLB_OUTPUT_09 0x00000200U //!< Mask for CLB OUTPUT ENABLE/DISABLE 9
#define CLB_OUTPUT_10 0x00000400U //!< Mask for CLB OUTPUT ENABLE/DISABLE 10
#define CLB_OUTPUT_11 0x00000800U //!< Mask for CLB OUTPUT ENABLE/DISABLE 11
#define CLB_OUTPUT_12 0x00001000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 12
#define CLB_OUTPUT_13 0x00002000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 13
#define CLB_OUTPUT_14 0x00004000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 14
#define CLB_OUTPUT_15 0x00008000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 15
#define CLB_OUTPUT_16 0x00010000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 16
#define CLB_OUTPUT_17 0x00020000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 17
#define CLB_OUTPUT_18 0x00040000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 18
#define CLB_OUTPUT_19 0x00080000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 19
#define CLB_OUTPUT_20 0x00100000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 20
#define CLB_OUTPUT_21 0x00200000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 21
#define CLB_OUTPUT_22 0x00400000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 22
#define CLB_OUTPUT_23 0x00800000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 23
#define CLB_OUTPUT_24 0x01000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 24
#define CLB_OUTPUT_25 0x02000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 25
#define CLB_OUTPUT_26 0x04000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 26
#define CLB_OUTPUT_27 0x08000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 27
#define CLB_OUTPUT_28 0x10000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 28
#define CLB_OUTPUT_29 0x20000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 29
#define CLB_OUTPUT_30 0x40000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 30
#define CLB_OUTPUT_31 0x80000000U //!< Mask for CLB OUTPUT ENABLE/DISABLE 31

//*****************************************************************************
//
//! Values that can be passed to select CLB input signal
//
//*****************************************************************************
typedef enum
{
    CLB_IN0 = 0,                    //!< Input 0
    CLB_IN1 = 1,                    //!< Input 1
    CLB_IN2 = 2,                    //!< Input 2
    CLB_IN3 = 3,                    //!< Input 3
    CLB_IN4 = 4,                    //!< Input 4
    CLB_IN5 = 5,                    //!< Input 5
    CLB_IN6 = 6,                    //!< Input 6
    CLB_IN7 = 7                     //!< Input 7
} CLB_Inputs;

//*****************************************************************************
//
//! Values that can be passed to select CLB output signal. It can be passed to
//! CLB_configOutputLUT() as the \e outID parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_OUT0 = 0,                   //!< Output 0
    CLB_OUT1 = 1,                   //!< Output 1
    CLB_OUT2 = 2,                   //!< Output 2
    CLB_OUT3 = 3,                   //!< Output 3
    CLB_OUT4 = 4,                   //!< Output 4
    CLB_OUT5 = 5,                   //!< Output 5
    CLB_OUT6 = 6,                   //!< Output 6
    CLB_OUT7 = 7                    //!< Output 7
} CLB_Outputs;

//*****************************************************************************
//
//! Values that can be passed to select CLB counter. It can be passed to
//! CLB_configCounterLoadMatch() as the \e counterID parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_CTR0 = 0,                   //!< Counter 0
    CLB_CTR1 = 1,                   //!< Counter 1
    CLB_CTR2 = 2                    //!< Counter 2
} CLB_Counters;

//*****************************************************************************
//
//! Values that can be passed to CLB_getRegisters() as the \e registerID
//! parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_REG_HLC_R0 = CLB_O_DBG_R0,  //!< HLC R0 register
    CLB_REG_HLC_R1 = CLB_O_DBG_R1,  //!< HLC R1 register
    CLB_REG_HLC_R2 = CLB_O_DBG_R2,  //!< HLC R2 register
    CLB_REG_HLC_R3 = CLB_O_DBG_R3,  //!< HLC R3 register
    CLB_REG_CTR_C0 = CLB_O_DBG_C0,  //!< Counter 0 register
    CLB_REG_CTR_C1 = CLB_O_DBG_C1,  //!< Counter 1 register
    CLB_REG_CTR_C2 = CLB_O_DBG_C2   //!< Counter 2 register
} CLB_Register;

//*****************************************************************************
//
//! Values that can be passed to CLB_selectInputFilter() as the \e filterType
//! parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_FILTER_NONE         = 0,    //!< No filtering
    CLB_FILTER_RISING_EDGE  = 1,    //!< Rising edge detect
    CLB_FILTER_FALLING_EDGE = 2,    //!< Falling edge detect
    CLB_FILTER_ANY_EDGE     = 3     //!< Any edge detect
} CLB_FilterType;

//*****************************************************************************
//
//! Values that can be passed to CLB_configGPInputMux() as the \e gpMuxCfg
//! parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_GP_IN_MUX_EXTERNAL  = 0,    //!< Use external input path
    CLB_GP_IN_MUX_GP_REG    = 1     //!< Use CLB_GP_REG bit value as input
} CLB_GPInputMux;

//*****************************************************************************
//
//! Values that can be passed to CLB_configLocalInputMux() as the
//! \e localMuxCfg parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_LOCAL_IN_MUX_GLOBAL_IN          = 0,   //!< Global input mux selection
    CLB_LOCAL_IN_MUX_EPWM_DCAEVT1       = 1,   //!< EPWMx DCAEVT1
    CLB_LOCAL_IN_MUX_EPWM_DCAEVT2       = 2,   //!< EPWMx DCAEVT2
    CLB_LOCAL_IN_MUX_EPWM_DCBEVT1       = 3,   //!< EPWMx DCBEVT1
    CLB_LOCAL_IN_MUX_EPWM_DCBEVT2       = 4,   //!< EPWMx DCBEVT2
    CLB_LOCAL_IN_MUX_EPWM_DCAH          = 5,   //!< EPWMx DCAH
    CLB_LOCAL_IN_MUX_EPWM_DCAL          = 6,   //!< EPWMx DCAL
    CLB_LOCAL_IN_MUX_EPWM_DCBH          = 7,   //!< EPWMx DCBH
    CLB_LOCAL_IN_MUX_EPWM_DCBL          = 8,   //!< EPWMx DCBL
    CLB_LOCAL_IN_MUX_EPWM_OST           = 9,   //!< EPWMx OST
    CLB_LOCAL_IN_MUX_EPWM_CBC           = 10,  //!< EPWMx CBC
    CLB_LOCAL_IN_MUX_ECAP_ECAPIN        = 11,  //!< ECAPx ECAPIN
    CLB_LOCAL_IN_MUX_ECAP_ECAP_OUT      = 12,  //!< ECAPx ECAP_OUT
    CLB_LOCAL_IN_MUX_ECAP_ECAP_OUT_EN   = 13,  //!< ECAPx ECAP_OUT_EN
    CLB_LOCAL_IN_MUX_ECAP_CEVT1         = 14,  //!< ECAPx CEVT1
    CLB_LOCAL_IN_MUX_ECAP_CEVT2         = 15,  //!< ECAPx CEVT2
    CLB_LOCAL_IN_MUX_ECAP_CEVT3         = 16,  //!< ECAPx CEVT3
    CLB_LOCAL_IN_MUX_ECAP_CEVT4         = 17,  //!< ECAPx CEVT4
    CLB_LOCAL_IN_MUX_EQEP_EQEPA         = 18,  //!< EQEPx EQEPA (CLB 1-4)
    CLB_LOCAL_IN_MUX_FSI_DATA_PKT_RCVD  = 18,  //!< FSI_DATA_PKT_RCVD(CLB 5-8)
    CLB_LOCAL_IN_MUX_EQEP_EQEPB         = 19,  //!< EQEPx EQEPB (CLB 1-4)
    CLB_LOCAL_IN_MUX_FSI_ERROR_PKT_RCVD = 19,  //!< FSI_ERROR_PKT_RCVD(CLB 5-8)
    CLB_LOCAL_IN_MUX_EQEP_EQEPI         = 20,  //!< EQEPx EQEPI (CLB 1-4)
    CLB_LOCAL_IN_MUX_FSI_PING_PKT_RCVD  = 20,  //!< FSI_PING_PKT_RCVD(CLB 5-8)
    CLB_LOCAL_IN_MUX_EQEP_EQEPS         = 21,  //!< EQEPx EQEPS (CLB 1-4)
    CLB_LOCAL_IN_MUX_CPU2_HALT          = 21,  //!< CPU2.HALT (CLB 5-8)
    CLB_LOCAL_IN_MUX_CPU1_TBCLKSYNC     = 22,  //!< CPU1.TBCLKSYNC
    CLB_LOCAL_IN_MUX_CPU2_TBCLKSYNC     = 23,  //!< CPU2.TBCLKSYNC
    CLB_LOCAL_IN_MUX_CPU1_HALT          = 24,  //!< CPU1.HALT
    CLB_LOCAL_IN_MUX_SPISIMO_MASTER     = 25,  //!< SPISIMO Master Output
    CLB_LOCAL_IN_MUX_SPICLK             = 26,  //!< SPI Clock
    CLB_LOCAL_IN_MUX_SPISIMO_SLAVE      = 27,  //!< SPISIMO Slave Input
    CLB_LOCAL_IN_MUX_SPISTE             = 28,  //!< SPI STE
    CLB_LOCAL_IN_MUX_SCI_TX             = 29,  //!< SCI TX
    CLB_LOCAL_IN_MUX_SPISOMI_OUT        = 30,  //!< SPISOMI(OUT)
    CLB_LOCAL_IN_MUX_CLB_PSCLK          = 31,  //!< CLB prescaled clock
    CLB_LOCAL_IN_MUX_EPWM9A             = 32,  //!< EPWM9A (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM13A            = 32,  //!< EPWM13A (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM9A_OE          = 33,  //!< EPWM9A trip output (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM13A_OE         = 33,  //!< EPWM13A trip output (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM9B             = 34,  //!< EPWM9B (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM13B            = 34,  //!< EPWM13B (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM9B_OE          = 35,  //!< EPWM9B trip output (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM13B_OE         = 35,  //!< EPWM13B trip output (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM10A            = 36,  //!< EPWM10A (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM14A            = 36,  //!< EPWM14A (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM10A_OE         = 37,  //!< EPWM10A trip output (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM14A_OE         = 37,  //!< EPWM14A trip output (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM10B            = 38,  //!< EPWM10B (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM14B            = 38,  //!< EPWM14B (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM10B_OE         = 39,  //!< EPWM10B trip output (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM14B_OE         = 39,  //!< EPWM14B trip output (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM11A            = 40,  //!< EPWM11A (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM15A            = 40,  //!< EPWM15A (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM11A_OE         = 41,  //!< EPWM11A trip output (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM15A_OE         = 41,  //!< EPWM15A trip output (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM11B            = 42,  //!< EPWM11B (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM15B            = 42,  //!< EPWM15B (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM11B_OE         = 43,  //!< EPWM11B trip output (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM15B_OE         = 43,  //!< EPWM15B trip output (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM12A            = 44,  //!< EPWM12A (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM16A            = 44,  //!< EPWM16A (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM12A_OE         = 45,  //!< EPWM12A trip output (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM16A_OE         = 45,  //!< EPWM16A trip output (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM12B            = 46,  //!< EPWM12B (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM16B            = 46,  //!< EPWM16B (CLB 5-8)
    CLB_LOCAL_IN_MUX_EPWM12B_OE         = 47,  //!< EPWM12B trip output (CLB 1-4)
    CLB_LOCAL_IN_MUX_EPWM16B_OE         = 47,  //!< EPWM16B trip output (CLB 5-8)
    CLB_LOCAL_IN_MUX_INPUT1             = 48,  //!< CLBINPUTXBAR INPUT1
    CLB_LOCAL_IN_MUX_INPUT2             = 49,  //!< CLBINPUTXBAR INPUT2
    CLB_LOCAL_IN_MUX_INPUT3             = 50,  //!< CLBINPUTXBAR INPUT3
    CLB_LOCAL_IN_MUX_INPUT4             = 51,  //!< CLBINPUTXBAR INPUT4
    CLB_LOCAL_IN_MUX_INPUT5             = 52,  //!< CLBINPUTXBAR INPUT5
    CLB_LOCAL_IN_MUX_INPUT6             = 53,  //!< CLBINPUTXBAR INPUT6
    CLB_LOCAL_IN_MUX_INPUT7             = 54,  //!< CLBINPUTXBAR INPUT7
    CLB_LOCAL_IN_MUX_INPUT8             = 55,  //!< CLBINPUTXBAR INPUT8
    CLB_LOCAL_IN_MUX_INPUT9             = 56,  //!< CLBINPUTXBAR INPUT9
    CLB_LOCAL_IN_MUX_INPUT10            = 57,  //!< CLBINPUTXBAR INPUT10
    CLB_LOCAL_IN_MUX_INPUT11            = 58,  //!< CLBINPUTXBAR INPUT11
    CLB_LOCAL_IN_MUX_INPUT12            = 59,  //!< CLBINPUTXBAR INPUT12
    CLB_LOCAL_IN_MUX_INPUT13            = 60,  //!< CLBINPUTXBAR INPUT13
    CLB_LOCAL_IN_MUX_INPUT14            = 61,  //!< CLBINPUTXBAR INPUT14
    CLB_LOCAL_IN_MUX_INPUT15            = 62,  //!< CLBINPUTXBAR INPUT15
    CLB_LOCAL_IN_MUX_INPUT16            = 63   //!< CLBINPUTXBAR INPUT16
} CLB_LocalInputMux;

//*****************************************************************************
//
//! Values that can be passed to CLB_configGlobalInputMux() as the
//! \e globalMuxCfg parameter.
//
//*****************************************************************************
typedef enum
{
    CLB_GLOBAL_IN_MUX_EPWM1A            = 0,   //!< EPWM1A (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5A            = 0,   //!< EPWM5A (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1A_OE         = 1,   //!< EPWM1A trip output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5A_OE         = 1,   //!< EPWM5A trip output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1B            = 2,   //!< EPWM1B (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5B            = 2,   //!< EPWM5B (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1B_OE         = 3,   //!< EPWM1B trip output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5B_OE         = 3,   //!< EPWM5B trip output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1_CTR_ZERO    = 4,   //!< EPWM1 TBCTR = Zero (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_ZERO    = 4,   //!< EPWM5 TBCTR = Zero (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1_CTR_PRD     = 5,   //!< EPWM1 TBCTR = TBPRD (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_PRD     = 5,   //!< EPWM5 TBCTR = TBPRD (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1_CTRDIR      = 6,   //!< EPWM1 CTRDIR (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5_CTRDIR      = 6,   //!< EPWM5 CTRDIR (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1_TBCLK       = 7,   //!< EPWM1 TBCLK (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5_TBCLK       = 7,   //!< EPWM5 TBCLK (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPA    = 8,   //!< EPWM1 TBCTR = CMPA (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPA    = 8,   //!< EPWM5 TBCTR = CMPA (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPB    = 9,   //!< EPWM1 TBCTR = CMPB (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPB    = 9,   //!< EPWM5 TBCTR = CMPB (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPC    = 10,  //!< EPWM1 TBCTR = CMPC (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPC    = 10,  //!< EPWM5 TBCTR = CMPC (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1_CTR_CMPD    = 11,  //!< EPWM1 TBCTR = CMPD (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5_CTR_CMPD    = 11,  //!< EPWM5 TBCTR = CMPD (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1A_AQ         = 12,  //!< EPWM1A AQ submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5A_AQ         = 12,  //!< EPWM5A AQ submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1B_AQ         = 13,  //!< EPWM1B AQ submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5B_AQ         = 13,  //!< EPWM5B AQ submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1A_DB         = 14,  //!< EPWM1A DB submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5A_DB         = 14,  //!< EPWM5A DB submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM1B_DB         = 15,  //!< EPWM1B DB submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM5B_DB         = 15,  //!< EPWM5B DB submodule output (CLB 5-8)

    CLB_GLOBAL_IN_MUX_EPWM2A            = 16,   //!< EPWM2A (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6A            = 16,   //!< EPWM6A (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2A_OE         = 17,   //!< EPWM2A trip output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6A_OE         = 17,   //!< EPWM6A trip output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2B            = 18,   //!< EPWM2B (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6B            = 18,   //!< EPWM6B (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2B_OE         = 19,   //!< EPWM2B trip output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6B_OE         = 19,   //!< EPWM6B trip output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2_CTR_ZERO    = 20,   //!< EPWM2 TBCTR = Zero (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6_CTR_ZERO    = 20,   //!< EPWM6 TBCTR = Zero (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2_CTR_PRD     = 21,   //!< EPWM2 TBCTR = TBPRD (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6_CTR_PRD     = 21,   //!< EPWM6 TBCTR = TBPRD (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2_CTRDIR      = 22,   //!< EPWM2 CTRDIR (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6_CTRDIR      = 22,   //!< EPWM6 CTRDIR (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2_TBCLK       = 23,   //!< EPWM2 TBCLK (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6_TBCLK       = 23,   //!< EPWM6 TBCLK (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPA    = 24,   //!< EPWM2 TBCTR = CMPA (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6_CTR_CMPA    = 24,   //!< EPWM6 TBCTR = CMPA (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPB    = 25,   //!< EPWM2 TBCTR = CMPB (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6_CTR_CMPB    = 25,   //!< EPWM6 TBCTR = CMPB (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPC    = 26,  //!< EPWM2 TBCTR = CMPC (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6_CTR_CMPC    = 26,  //!< EPWM6 TBCTR = CMPC (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2_CTR_CMPD    = 27,  //!< EPWM2 TBCTR = CMPD (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6_CTR_CMPD    = 27,  //!< EPWM6 TBCTR = CMPD (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2A_AQ         = 28,  //!< EPWM2A AQ submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6A_AQ         = 28,  //!< EPWM6A AQ submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2B_AQ         = 29,  //!< EPWM2B AQ submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6B_AQ         = 29,  //!< EPWM6B AQ submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2A_DB         = 30,  //!< EPWM2A DB submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6A_DB         = 30,  //!< EPWM6A DB submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM2B_DB         = 31,  //!< EPWM2B DB submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM6B_DB         = 31,  //!< EPWM6B DB submodule output (CLB 5-8)

