maxboss10086/max_dsp/max/F28388D/clb_pwm/device/driverlib/clb.h
    CLB_GLOBAL_IN_MUX_EPWM3A            = 32,   //!< EPWM3A (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7A            = 32,   //!< EPWM7A (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3A_OE         = 33,   //!< EPWM3A trip output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7A_OE         = 33,   //!< EPWM7A trip output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3B            = 34,   //!< EPWM3B (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7B            = 34,   //!< EPWM7B (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3B_OE         = 35,   //!< EPWM3B trip output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7B_OE         = 35,   //!< EPWM7B trip output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_ZERO    = 36,   //!< EPWM3 TBCTR = Zero (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_ZERO    = 36,   //!< EPWM7 TBCTR = Zero (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_PRD     = 37,   //!< EPWM3 TBCTR = TBPRD (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_PRD     = 37,   //!< EPWM7 TBCTR = TBPRD (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3_CTRDIR      = 38,   //!< EPWM3 CTRDIR (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7_CTRDIR      = 38,   //!< EPWM7 CTRDIR (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3_TBCLK       = 39,   //!< EPWM3 TBCLK (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7_TBCLK       = 39,   //!< EPWM7 TBCLK (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPA    = 40,   //!< EPWM3 TBCTR = CMPA (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPA    = 40,   //!< EPWM7 TBCTR = CMPA (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPB    = 41,   //!< EPWM3 TBCTR = CMPB (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPB    = 41,   //!< EPWM7 TBCTR = CMPB (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPC    = 42,  //!< EPWM3 TBCTR = CMPC (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPC    = 42,  //!< EPWM7 TBCTR = CMPC (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3_CTR_CMPD    = 43,  //!< EPWM3 TBCTR = CMPD (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7_CTR_CMPD    = 43,  //!< EPWM7 TBCTR = CMPD (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3A_AQ         = 44,  //!< EPWM3A AQ submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7A_AQ         = 44,  //!< EPWM7A AQ submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3B_AQ         = 45,  //!< EPWM3B AQ submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7B_AQ         = 45,  //!< EPWM7B AQ submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3A_DB         = 46,  //!< EPWM3A DB submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7A_DB         = 46,  //!< EPWM7A DB submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM3B_DB         = 47,  //!< EPWM3B DB submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM7B_DB         = 47,  //!< EPWM7B DB submodule output (CLB 5-8)

    CLB_GLOBAL_IN_MUX_EPWM4A            = 48,   //!< EPWM4A (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8A            = 48,   //!< EPWM8A (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4A_OE         = 49,   //!< EPWM4A trip output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8A_OE         = 49,   //!< EPWM8A trip output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4B            = 50,   //!< EPWM4B (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8B            = 50,   //!< EPWM8B (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4B_OE         = 51,   //!< EPWM4B trip output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8B_OE         = 51,   //!< EPWM8B trip output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_ZERO    = 52,   //!< EPWM4 TBCTR = Zero (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8_CTR_ZERO    = 52,   //!< EPWM8 TBCTR = Zero (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_PRD     = 53,   //!< EPWM4 TBCTR = TBPRD (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8_CTR_PRD     = 53,   //!< EPWM8 TBCTR = TBPRD (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4_CTRDIR      = 54,   //!< EPWM4 CTRDIR (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8_CTRDIR      = 54,   //!< EPWM8 CTRDIR (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4_TBCLK       = 55,   //!< EPWM4 TBCLK (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8_TBCLK       = 55,   //!< EPWM8 TBCLK (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPA    = 56,   //!< EPWM4 TBCTR = CMPA (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8_CTR_CMPA    = 56,   //!< EPWM8 TBCTR = CMPA (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPB    = 57,   //!< EPWM4 TBCTR = CMPB (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8_CTR_CMPB    = 57,   //!< EPWM8 TBCTR = CMPB (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPC    = 58,  //!< EPWM4 TBCTR = CMPC (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8_CTR_CMPC    = 58,  //!< EPWM8 TBCTR = CMPC (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4_CTR_CMPD    = 59,  //!< EPWM4 TBCTR = CMPD (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8_CTR_CMPD    = 59,  //!< EPWM8 TBCTR = CMPD (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4A_AQ         = 60,  //!< EPWM4A AQ submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8A_AQ         = 60,  //!< EPWM8A AQ submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4B_AQ         = 61,  //!< EPWM4B AQ submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8B_AQ         = 61,  //!< EPWM8B AQ submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4A_DB         = 62,  //!< EPWM4A DB submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8A_DB         = 62,  //!< EPWM8A DB submodule output (CLB 5-8)
    CLB_GLOBAL_IN_MUX_EPWM4B_DB         = 63,  //!< EPWM4B DB submodule output (CLB 1-4)
    CLB_GLOBAL_IN_MUX_EPWM8B_DB         = 63,  //!< EPWM8B DB submodule output (CLB 5-8)

    CLB_GLOBAL_IN_MUX_CLB_AUXSIG0       = 64,  //!< CLB X-BAR AUXSIG0
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG1       = 65,  //!< CLB X-BAR AUXSIG1
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG2       = 66,  //!< CLB X-BAR AUXSIG2
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG3       = 67,  //!< CLB X-BAR AUXSIG3
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG4       = 68,  //!< CLB X-BAR AUXSIG4
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG5       = 69,  //!< CLB X-BAR AUXSIG5
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG6       = 70,  //!< CLB X-BAR AUXSIG6
    CLB_GLOBAL_IN_MUX_CLB_AUXSIG7       = 71   //!< CLB X-BAR AUXSIG7
} CLB_GlobalInputMux;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//
//!
//! Checks the CLB base address.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function determines if a CLB base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool CLB_isBaseValid(uint32_t base)
{
    return(
           (base == CLB1_BASE) ||
           (base == CLB2_BASE) ||
           (base == CLB3_BASE) ||
           (base == CLB4_BASE) ||
           (base == CLB5_BASE) ||
           (base == CLB6_BASE) ||
           (base == CLB7_BASE) ||
           (base == CLB8_BASE)
          );
}

//*****************************************************************************
//
//!
//! Checks the CLB internal memory address.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function determines if a CLB base address is valid.
//!
//! \return Returns \b true if the address is valid and \b false otherwise.
//
//*****************************************************************************
static inline bool CLB_isAddressValid(uint32_t address)
{
    return(address <= (CLB_ADDR_HLC_BASE + CLB_NUM_HLC_INSTR));
}
#endif

//*****************************************************************************
//
//! Set global enable.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables the CLB via global enable register.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_enableCLB(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    EALLOW;
    HWREGH(base + CLB_LOGICCTL + CLB_O_LOAD_EN) |= CLB_LOAD_EN_GLOBAL_EN;
    EDIS;
}

//*****************************************************************************
//
//! Enable CLB lock.
//!
//! \param base is the base address of a CLB tile's logic config register.
//!
//! This function enables the lock bit of the lock register. The lock can only
//! be set once and can only be cleared by a device reset.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_enableLock(uint32_t base)
{
    ASSERT(CLB_isBaseValid(base));

    //
    // Setting the lock bit requires key 0x5A5A to be written at the same time
    //
    EALLOW;
    HWREG(base + CLB_LOGICCTL + CLB_O_LOCK) =
        (uint32_t)CLB_LOCK_LOCK | ((uint32_t)CLB_LOCK_KEY << CLB_LOCK_KEY_S);
    EDIS;
}

//*****************************************************************************
//
//! Write value to address.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param address is the address of CLB internal memory.
//! \param value is the value to write to specified address.
//!
//! This function writes the specified value to CLB internal memory.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_writeInterface(uint32_t base, uint32_t address,
                                      uint32_t value)
{
    ASSERT(CLB_isBaseValid(base));
    ASSERT(CLB_isAddressValid(address));

    EALLOW;
    HWREG(base + CLB_LOGICCTL + CLB_O_LOAD_ADDR) = address;
    HWREG(base + CLB_LOGICCTL + CLB_O_LOAD_DATA) =  value;
    HWREG(base + CLB_LOGICCTL + CLB_O_LOAD_EN) |= CLB_LOAD_EN_LOAD_EN;
    EDIS;
}

//*****************************************************************************
//
//! Select input filter type.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param inID is the specified CLB tile input signal.
//! \param filterType is the selected type of filter applied to the input.
//!
//! This function configures the filter selection for the specified input.
//! The \e inID parameter can have one enumeration value from CLB_Inputs.
//! The \e filterType parameter can have one enumeration value from
//! CLB_FilterType.
//!
//! \return None.
//
//*****************************************************************************
//¼ÙÉèÊäÈë7£¬ÉÏÉýÑØÂË²¨1
static inline void CLB_selectInputFilter(uint32_t base, CLB_Inputs inID,
                                         CLB_FilterType filterType)
{
    uint16_t shiftVal;

    ASSERT(CLB_isBaseValid(base));

    //
    // Each input has a 2-bit field in this register so need to calculate
    // shift amount accordingly.
    //
    shiftVal = (uint16_t)inID << 1;
//base+256+6
    HWREGH(base + CLB_LOGICCTL + CLB_O_INPUT_FILTER) =
        (HWREGH(base + CLB_LOGICCTL + CLB_O_INPUT_FILTER) &
         ~(CLB_INPUT_FILTER_FIN0_M << shiftVal)) |//0011_1111_1111_1111
        ((uint16_t)filterType << shiftVal);//100_0000_0000_0000
}                                           //0111_1111_1111_1111 ==15-14Îª01£¬¼´in7¼Ä´æÆ÷ÉÏÉýÑØÂË²¨

//*****************************************************************************
//
//! Enables synchronization of an input signal.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param inID is the specified CLB tile input signal.
//!
//! This function enables synchronization on the specified input signal.
//! The \e inID parameter can have one enumeration value from CLB_Inputs.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_enableSynchronization(uint32_t base, CLB_Inputs inID)
{
    ASSERT(CLB_isBaseValid(base));

    HWREGH(base + CLB_LOGICCTL + CLB_O_INPUT_FILTER + 1U) |=
                                                    (1U << (uint16_t)inID);
}

//*****************************************************************************
//
//! Disables synchronization of an input signal.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param inID is the specified CLB tile input signal.
//!
//! This function disables synchronization on the specified input signal.
//! The \e inID parameter can have one enumeration value from CLB_Inputs.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_disableSynchronization(uint32_t base, CLB_Inputs inID)
{
    ASSERT(CLB_isBaseValid(base));

    HWREGH(base + CLB_LOGICCTL + CLB_O_INPUT_FILTER + 1U) &=
                                                    ~(1U << (uint16_t)inID);
}

//*****************************************************************************
//
//! Configures the general purpose input mux.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param inID is the specified CLB tile input signal.
//! \param gpMuxCfg is the mux selection for the general purpose input mux.
//!
//! This function configures the general purpose input mux. The \e gpMuxCfg
//! parameter can select either the use of an external input signal
//! (\b CLB_GP_IN_MUX_EXTERNAL) or the use of the corresponding CLB_GP_REG bit
//! as an input (\b CLB_GP_IN_MUX_GP_REG).
//! The \e inID parameter can have one enumeration value from CLB_Inputs.
//!
//! \sa CLB_setGPREG() to write to the CLB_GP_REG.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_configGPInputMux(uint32_t base, CLB_Inputs inID,
                                        CLB_GPInputMux gpMuxCfg)
{
    ASSERT(CLB_isBaseValid(base));

    HWREGH(base + CLB_LOGICCTL + CLB_O_IN_MUX_SEL_0) =
        (HWREGH(base + CLB_LOGICCTL + CLB_O_IN_MUX_SEL_0) &
         ~(CLB_IN_MUX_SEL_0_SEL_GP_IN_0 << inID)) | (gpMuxCfg << inID);
}

//*****************************************************************************
//
//! Sets the CLB_GP_REG register value.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param gpRegVal is the value to be written to CLB_GP_REG.
//!
//! This function writes to the CLB_GP_REG register. When the general purpose
//! input mux is configured to use CLB_GP_REG, each bit in \e gpRegVal
//! corresponds to an input signal (bit 0 to Input 0, bit 1 to Input 1, and
//! so on).
//!
//! \sa CLB_configGPInputMux() to select the CLB_GP_REG as the source for
//! an input signal.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_setGPREG(uint32_t base, uint32_t gpRegVal)
{
    ASSERT(CLB_isBaseValid(base));

    HWREG(base + CLB_LOGICCTL + CLB_O_GP_REG) = gpRegVal;
}

//*****************************************************************************
//
//! Configures the local input mux.
//!
//! \param base is the base address of a CLB tile's logic config register.
//! \param inID is the specified CLB tile input signal.
//! \param localMuxCfg is the mux selection for the local input mux.
//!
//! This function configures the local input mux for the specified input
//! signal.
//!
//! The \e inID parameter can have one enumeration value from CLB_Inputs.
//! The \e localMuxCfg parameter can have one enumeration value from
//! CLB_LocalInputMux.
//!
//! \note The local input mux options' peripheral sources depend on which
//! instance of the CLB (\e base) you are using. For example, for CLB1 the
//! EPWM signal selections come from EPWM1 but for CLB2 they come from EPWM2.
//! See your technical reference manual for details.
//!
//! \return None.
//
//*****************************************************************************
static inline void CLB_configLocalInputMux(uint32_t base, CLB_Inputs inID,
                                            CLB_LocalInputMux localMuxCfg)
{
    uint16_t shiftVal;
    uint32_t miscShiftVal, inputMuxSel;

    ASSERT(CLB_isBaseValid(base));

    //
    // Each local input has a 5-bit field in this register so need to calculate
    // shift amount accordingly.
    //
    shiftVal = (uint16_t)inID * CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_1_S;

    //
    // If the local inputs are selected then only 5-bits are used in this
    // register but if miscellaneous inputs are selected then another 1-bit is
    // used along with the above 5. So we need to calculate this accordingly.
    //

    //
    // Each miscellaneous input has a 1-bit field in this register so
    // need to calculate shift amount accordingly.
    //
    miscShiftVal = (uint32_t)inID + CLB_LCL_MUX_SEL_MISC_INPUT_SEL_S;

    //
    // Check if input < input4
    //
    if(inID < CLB_IN4)
    {
        //
        // Each miscellaneous input has an extra 1-bit to be set
        // apart from the local input bits
        //
        inputMuxSel =
       ((((uint32_t)localMuxCfg & CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_0_M) <<
        shiftVal)|
       ((((uint32_t)localMuxCfg & CLB_LCL_MUX_SEL_MISC_INPUT_SEL_M) >>
        CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_1_S) << miscShiftVal));

        //
        //Update the local / misc input mux selections
        //
        HWREG(base + CLB_LOGICCTL + CLB_O_LCL_MUX_SEL_1) =
       (HWREG(base + CLB_LOGICCTL + CLB_O_LCL_MUX_SEL_1) &
        ~(((uint32_t)CLB_LCL_MUX_SEL_1_LCL_MUX_SEL_IN_0_M << shiftVal) |
         (CLB_LCL_MUX_SEL_MISC_INPUT_SEL_BITM << miscShiftVal))) |
        inputMuxSel;
    }
    else
    {
        //
        //Adjust the previously calculated shifts for the inputs >3
        //
        shiftVal -= 4U * CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_5_S;
        miscShiftVal -= 4U;

        //
        // Each miscellaneous input has an extra 1-bit to be set
        // apart from the local input bits
        //
        inputMuxSel =
        (((uint32_t)(localMuxCfg & CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_4_M) <<
        shiftVal)|
        ((((uint32_t)localMuxCfg & CLB_LCL_MUX_SEL_MISC_INPUT_SEL_M) >>
        CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_5_S) << miscShiftVal));

        HWREG(base + CLB_LOGICCTL + CLB_O_LCL_MUX_SEL_2) =
       (HWREG(base + CLB_LOGICCTL + CLB_O_LCL_MUX_SEL_2) &
        ~(((uint32_t)CLB_LCL_MUX_SEL_2_LCL_MUX_SEL_IN_4_M << shiftVal) |
         (CLB_LCL_MUX_SEL_MISC_INPUT_SEL_BITM << miscShiftVal))) |
        inputMuxSel;

